# SQL LAB on AWS RDS

## Before you do labs in class, try your best to write and test your sql code on labs

## If you don't have AWS RDS account, install MySQL and anaconda on your local machine

In [1]:
#!pip install ipython-sql
%load_ext sql

In [2]:
!pip install pymysql
!pip install sql

Requirement already satisfied: pymysql in c:\users\youngju hong\anaconda3\lib\site-packages (0.10.1)
Requirement already satisfied: sql in c:\users\youngju hong\anaconda3\lib\site-packages (0.4.0)

In [3]:
import getpass
user = 'hong'
password = getpass.getpass()
host='database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com'
database = ''
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

········

In [4]:
%sql show databases

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('companydb',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',),
 ('univdb',)]

In [5]:
%sql use companydb

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [6]:
%sql show tables;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
11 rows affected.

[('DEPARTMENT',),
 ('DEPENDENT',),
 ('DEPT_LOCATIONS',),
 ('DEPT_VIEW',),
 ('EMPLOYEE',),
 ('PROJECT',),
 ('PROJECT_VIEW',),
 ('PROJECT_VIEW_GT2',),
 ('RESEARCH_DEPT_VIEW',),
 ('WORKS_ON',),
 ('salary_audit',)]

In [7]:
%sql desc EMPLOYEE

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
10 rows affected.

[('Fname', 'varchar(15)', 'NO', '', None, ''),
 ('Minit', 'char(1)', 'YES', '', None, ''),
 ('Lname', 'varchar(15)', 'NO', '', None, ''),
 ('Ssn', 'char(9)', 'NO', 'PRI', None, ''),
 ('Bdate', 'date', 'YES', '', None, ''),
 ('Address', 'varchar(30)', 'YES', '', None, ''),
 ('Sex', 'char(1)', 'YES', '', None, ''),
 ('Salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('Superssn', 'char(9)', 'YES', 'MUL', None, ''),
 ('Dno', 'int(11)', 'YES', 'MUL', None, '')]

## Create companydb and load data
## This is done only ONCE; Do NOT run this cell 
## Whenever database is corrupted, run this cell

In [8]:
%%sql

SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;

DROP DATABASE IF EXISTS companydb;
CREATE DATABASE IF NOT EXISTS companydb;
USE companydb;

DROP TABLE IF EXISTS DEPENDENT;
DROP TABLE IF EXISTS WORKS_ON;
DROP TABLE IF EXISTS PROJECT;
DROP TABLE IF EXISTS DEPT_LOCATIONS;
DROP TABLE IF EXISTS DEPARTMENT;
DROP TABLE IF EXISTS EMPLOYEE;

CREATE TABLE EMPLOYEE
(       Fname VARCHAR(15) NOT NULL,
        Minit CHAR,
        Lname VARCHAR(15) NOT NULL,
        Ssn CHAR(9) NOT NULL,
        Bdate DATE,
        Address VARCHAR(30),
        Sex CHAR,
        Salary DECIMAL(10, 2),
        Superssn CHAR(9),
        Dno INT,
        PRIMARY KEY (Ssn),
        FOREIGN KEY (Superssn) 
                REFERENCES EMPLOYEE(Ssn) 
                ON DELETE SET NULL
                ON UPDATE CASCADE,
        FOREIGN KEY (Dno) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPARTMENT
(       Dname VARCHAR(15) NOT NULL,
        Dnumber INT NOT NULL,
        Mgrssn CHAR(9),
        Mgrstartdate DATE,
        PRIMARY KEY (Dnumber),
        UNIQUE (Dname),
        FOREIGN KEY (Mgrssn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPT_LOCATIONS
(       Dnumber INT NOT NULL,
        Dlocation VARCHAR(15) NOT NULL,
        PRIMARY KEY (Dnumber, Dlocation),
        FOREIGN KEY (Dnumber)
                REFERENCES DEPARTMENT(Dnumber) 
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE PROJECT
(       Pname VARCHAR(15) NOT NULL,
        Pnumber INT NOT NULL,
        Plocation VARCHAR(15),
        Dnum INT,
        PRIMARY KEY (Pnumber),
        UNIQUE (Pname),
        FOREIGN KEY (Dnum) 
                REFERENCES DEPARTMENT(Dnumber)
                ON DELETE SET NULL
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE WORKS_ON
(       Essn CHAR(9) NOT NULL,
        Pno INT NOT NULL,
        Hours DECIMAL(3, 1) ,
        PRIMARY KEY (Essn, Pno),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Pno) 
                REFERENCES PROJECT(Pnumber)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE DEPENDENT
(       Essn CHAR(9) NOT NULL,
        Dependent_name VARCHAR(15) NOT NULL,
        Sex CHAR,
        Bdate DATE,
        Relationship VARCHAR(8),
        PRIMARY KEY (Essn, Dependent_name),
        FOREIGN KEY (Essn) 
                REFERENCES EMPLOYEE(Ssn)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


insert into EMPLOYEE values
        ("John", "B", "Smith", "123456789","1965-01-09", "731-Fondren-Houston-TX", "M", 30000, "333445555", 5),
        ("Franklin", "T", "Wong", "333445555","1955-12-08", "638-Voss-Houston-TX", "M", 40000, "888665555", 5),
        ("Alicia", "J", "Zelaya", "999887777", "1968-01-19", "3321-Castle-Spring-TX", "F", 25000, "987654321", 4),
        ("Jennifer", "S", "Wallace", "987654321", "1941-06-20", "291-Berry-Bellaire-TX", "F", 43000, "888665555", 4),
        ("Ramesh", "K", "Narayan", "666884444", "1962-09-15", "975-Fire-Oak-Humble-TX", "M", 38000, "333445555", 5),
        ("Joyce", "A", "English", "453453453", "1972-07-31", "5631-Rice-Houston-TX", "F", 25000, "333445555", 5),
        ("Ahmad", "V", "Jabbar", "987987987", "1969-03-29", "980-Dallas-Houston-TX", "M", 25000, "987654321", 4),
        ("James", "E", "Borg", "888665555", "1937-11-10", "450-Stone-Houston-TX", "M", 55000, NULL, 1);


insert into DEPENDENT  values 
        (333445555, "Alice", "F","1986-04-05", "Daughter"),
        (333445555, "Theodore", "M","1983-10-25", "Son"),
        (333445555, "Joy", "F","1958-05-03", "Spouse"),
        (987654321, "Abner", "M","1942-02-28", "Spouse"),
        (123456789, "Michael", "M","1988-01-04", "Son"),
        (123456789, "Alice", "F", "1988-12-30", "Daughter"),
        (123456789, "Elizabeth", "F", "1967-05-05", "Spouse");


insert into DEPARTMENT values 
        ("Research", 5, 333445555,"1988-05-22"),
        ("Administration", 4, 987654321,"1995-01-01"),
        ("Headquarters", 1, 888665555,"1981-06-19");

insert into DEPT_LOCATIONS values 
        (1, "Houston"),
        (4, "Stafford"),
        (5, "Bellaire"),
        (5, "Sugarland"),
        (5, "Houston");


insert into PROJECT values 
        ("ProductX", 1, "Bellaire", 5),
        ("ProductY", 2, "Sugarland", 5),
        ("ProductZ", 3, "Houston", 5),
        ("Computerization", 10, "Stafford", 4),
        ("Reorganization", 20, "Houston", 1),
        ("Newbenefits", 30, "Stafford", 4);


insert into WORKS_ON values
        (123456789, 1, 32.5),
        (123456789, 2, 7.5),
        (666884444, 3, 40.0),
        (453453453, 1, 20.0),
        (453453453, 2, 20.0),
        (333445555, 2, 10.0),
        (333445555, 3, 10.0),
        (333445555, 10, 10.0),
        (333445555, 20, 10.0),
        (999887777, 30, 30.0),
        (999887777, 10, 10.0),
        (987987987, 10, 35.0),
        (987987987, 30, 5.0),
        (987654321, 30, 20.0),
        (987654321, 20, 15.0),
        (888665555, 20, NULL); 

SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS;
SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.
0 rows affected.
11 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
8 rows affected.
7 rows affected.
3 rows affected.
5 rows affected.
6 rows affected.
16 rows affected.
0 rows affected.
0 rows affected.

[]

In [9]:
%sql select * from EMPLOYEE;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [10]:
%sql drop table if exists emp;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

## create table 
```
emp(ssn)
PK: ssn
```

In [11]:
%sql drop table if exists emp;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [12]:
%%sql

create table emp (
    ssn char(9) primary key #pk 선언은 어디에 적어도 상관없음
) engine=InnoDB;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

## create table 
```
dept(dname, dnumbr, mgrssn, mgrstartdate)
K: dname, dnumber
PK: dnumber
FK: mgrssn -> emp
```

In [13]:
%%sql

create table dept (
    dname varchar(20) not null,
    dnumber integer not null,
    mgrssn char(9),
    mgrstartdate date,
    primary key (dnumber),
    unique (dname),
    foreign key (mgrssn) references emp(ssn) 
        on delete cascade
) engine = InnoDB;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [14]:
%%sql

insert into dept values ('Research', 5, '333445551', '1988-05-02');
/* 참조무결정 제약조건 위반 */

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/

IntegrityError: (pymysql.err.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`companydb`.`dept`, CONSTRAINT `dept_ibfk_1` FOREIGN KEY (`mgrssn`) REFERENCES `emp` (`ssn`) ON DELETE CASCADE)')
[SQL: insert into dept values ('Research', 5, '333445551', '1988-05-02');]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [ ]:
%%sql
insert into emp values("333445555");
insert into emp values("987654321");
insert into emp values("886655555");

In [ ]:
%sql select * from emp;
#데이터 조회

In [ ]:
%sql insert into emp values("333445555"); #마찬가지로 참조무결성 제약조건 위반

In [ ]:
%%sql

insert into dept values("Research", 5, "333445555", "1988-05-02");
insert into dept values("Administration", 4, "987654321", "1995-01-01");
insert into dept values("Headquarters", 5, "8866555892", "1981-06-19");

In [ ]:
%sql select * from emp;

In [39]:
%sql delete from emp; #삭제 + ondelete cascade에 의해 ssn도 삭제

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[]

In [40]:
%sql select * from emp; #삭제됨

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [21]:
%sql desc emp;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('ssn', 'char(9)', 'NO', 'PRI', None, '')]

In [32]:
%sql desc dept;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('dname', 'varchar(20)', 'NO', 'UNI', None, ''),
 ('dnumber', 'int(11)', 'NO', 'PRI', None, ''),
 ('mgrssn', 'char(9)', 'YES', 'MUL', None, ''),
 ('mgrstartdate', 'date', 'YES', '', None, '')]

In [22]:
%sql desc emp; #ondelete cascade이기에 다 날라가버렸음

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.
0 rows affected.

[]

## Try this: MySQL comment

In [23]:
%%sql

select * 
from EMPLOYEE
/*where Salary >= 50000*/ 
-- comment until the end of line
-- and dno = 5

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [24]:
%%sql 

insert into emp values( '333445555' );
insert into emp values( '987654321');
insert into emp values( '886655555' );

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [25]:
%%sql 

-- insert into dept values ('Research', 5, '333445551', '1988-05-02');
insert into dept values ('Research', 5, '333445555', '1988-05-02');
insert into dept values ('Administration', 4, '987654321', '1995-01-01');
insert into dept values ('Headquarters', 1, '886655555', '1981-06-19');

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Try this:
```
select * 
from EMPLOYEE e, DEPARTMENT d, PROJECT p
```

## LAB 1: ‘Research’ 부서에서 일하는 모든 종업원들의 이름과 주소를 검색하시오.

In [28]:
%%sql

select fname, lname, address from EMPLOYEE

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'Smith', '731-Fondren-Houston-TX'),
 ('Franklin', 'Wong', '638-Voss-Houston-TX'),
 ('Joyce', 'English', '5631-Rice-Houston-TX'),
 ('Ramesh', 'Narayan', '975-Fire-Oak-Humble-TX'),
 ('James', 'Borg', '450-Stone-Houston-TX'),
 ('Jennifer', 'Wallace', '291-Berry-Bellaire-TX'),
 ('Ahmad', 'Jabbar', '980-Dallas-Houston-TX'),
 ('Alicia', 'Zelaya', '3321-Castle-Spring-TX')]

## LAB 2 :  salary가 30000 이상 50000이하인 직원의 lname?

In [30]:
%%sql

select lname from EMPLOYEE
where salary >= 30000 and salary <= 50000

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('Smith',), ('Wong',), ('Narayan',), ('Wallace',)]

In [ ]:
%%sql

## LAB 3: 4번 또는 5번 부서의 남자 직원의 lname?

In [31]:
%%sql

select lname from EMPLOYEE
where (dno = 4 or dno = 5) and sex = "M"

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('Jabbar',), ('Smith',), ('Wong',), ('Narayan',)]

## LAB 4: 5번 부서에 근무하는 직원의 부양가족의 이름?

In [34]:
%%sql

select dependent_name
from EMPLOYEE E, DEPENDENT D
where E.Dno = 5 and E.Ssn = D.Essn

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('Alice',), ('Elizabeth',), ('Michael',), ('Alice',), ('Joy',), ('Theodore',)]

## LAB 5: 'Research' 부서에 근무하는 직원의 부양가족의 이름?

In [36]:
%%sql

select Distinct D.Dependent_name
from DEPENDENT AS D, EMPLOYEE AS E, DEPARTMENT AS DEPT
where DEPT.Dname = "Research"

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('Alice',), ('Elizabeth',), ('Michael',), ('Joy',), ('Theodore',), ('Abner',)]

## LAB 6: James Borg의 직접 부하직원의 lname은?

In [38]:
%%sql 

select s.lname, s.fname
from EMPLOYEE e, EMPLOYEE s
where e.lname = "Borg" and e.fname = "James" and e.ssn = s.superssn

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Wong', 'Franklin'), ('Wallace', 'Jennifer')]

## LAB 7: James Borg의 부하직원과 그 부하직원의 부하직원의 lname를 찾으시오.

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
7 rows affected.

[('Wong',),
 ('Wallace',),
 ('Smith',),
 ('English',),
 ('Narayan',),
 ('Jabbar',),
 ('Zelaya',)]

## Try this: DISTINCT

In [ ]:
%sql select sex from EMPLOYEE;

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
8 rows affected.

[('M',), ('M',), ('F',), ('M',), ('M',), ('F',), ('M',), ('F',)]

In [ ]:
%sql select distinct sex from EMPLOYEE;

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
2 rows affected.

[('M',), ('F',)]

### Do we need distinct
```
select distinct salary, ssn from EMPLOYEE;
```

In [ ]:
%%sql

select distinct ssn, salary from EMPLOYEE;

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
8 rows affected.

[('123456789', Decimal('30000.00')),
 ('333445555', Decimal('40000.00')),
 ('453453453', Decimal('25000.00')),
 ('666884444', Decimal('38000.00')),
 ('888665555', Decimal('55000.00')),
 ('987654321', Decimal('43000.00')),
 ('987987987', Decimal('25000.00')),
 ('999887777', Decimal('25000.00'))]

#### Answer: No

### Do we need distinct
```
select ssn, dname
from EMPLOYEE e, DEPARTMENT d, PROJECT p
where e.ssn = d.mgrssn and d.dnumber = p.dnum;
```

In [ ]:
%%sql

select ssn, dname
from EMPLOYEE e, DEPARTMENT d, PROJECT p
where e.ssn = d.mgrssn and d.dnumber = p.dnum;

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
6 rows affected.

[('888665555', 'Headquarters'),
 ('987654321', 'Administration'),
 ('987654321', 'Administration'),
 ('333445555', 'Research'),
 ('333445555', 'Research'),
 ('333445555', 'Research')]

### Answer: Yes

### Do we need distinct
```
select ssn, pno
from EMPLOYEE e, WORKS_ON, PROJECT p
```

In [ ]:
%%sql

select ssn, pno
from EMPLOYEE e, WORKS_ON, PROJECT p

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
768 rows affected.

[('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('888665555', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987654321', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('987987987', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('999887777', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('123456789', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('333445555', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('453453453', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('666884444', 1),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('888665555', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987654321', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('987987987', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('999887777', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('123456789', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('333445555', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('453453453', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('666884444', 2),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('888665555', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987654321', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('987987987', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('999887777', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('123456789', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('333445555', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('453453453', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('666884444', 3),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('888665555', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987654321', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('987987987', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('999887777', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('123456789', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('333445555', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('453453453', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('666884444', 10),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('888665555', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987654321', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('987987987', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('999887777', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('123456789', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('333445555', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('453453453', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('666884444', 20),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('888665555', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987654321', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('987987987', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('999887777', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('123456789', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('333445555', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('453453453', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30),
 ('666884444', 30)]

### Answer: Yes

### Do we need distinct
```
select pnumber
from EMPLOYEE e, DEPARTMENT d, PROJECT p
where e.ssn = d.mgrssn and d.dnumber = p.dnum;
```

### Answer: No

## Try this: UNION과 UNION ALL의 차이

In [ ]:
%%sql

(select ssn from EMPLOYEE) union all (select essn from DEPENDENT);

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
15 rows affected.

[('888665555',),
 ('987654321',),
 ('987987987',),
 ('999887777',),
 ('123456789',),
 ('333445555',),
 ('453453453',),
 ('666884444',),
 ('123456789',),
 ('123456789',),
 ('123456789',),
 ('333445555',),
 ('333445555',),
 ('333445555',),
 ('987654321',)]

In [ ]:
%%sql

(select ssn from EMPLOYEE) union (select essn from DEPENDENT);

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
8 rows affected.

[('888665555',),
 ('987654321',),
 ('987987987',),
 ('999887777',),
 ('123456789',),
 ('333445555',),
 ('453453453',),
 ('666884444',)]

## Try this: MySQL은 intersect와 except를 지원하지 않음

In [41]:
%%sql

(select ssn from EMPLOYEE) intersect (select essn from DEPENDENT);

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'intersect (select essn from DEPENDENT)' at line 1")
[SQL: (select ssn from EMPLOYEE) intersect (select essn from DEPENDENT);]
(Background on this error at: http://sqlalche.me/e/f405)

In [ ]:
%%sql

(select ssn from EMPLOYEE) minus (select essn from DEPENDENT);

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'minus (select essn from DEPENDENT)' at line 1")
[SQL: (select ssn from EMPLOYEE) minus (select essn from DEPENDENT);]
(Background on this error at: http://sqlalche.me/e/13/f405)

### Use exists instead

In [ ]:
%%sql

select ssn 
from EMPLOYEE e
where not exists (select * from DEPENDENT de where e.ssn = de.essn)

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
5 rows affected.

[('888665555',),
 ('987987987',),
 ('999887777',),
 ('453453453',),
 ('666884444',)]

## LAB 8: Smith가 관리자인 projects 또는 Smith가 참여하는 projects

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
2 rows affected.

[('ProductX',), ('ProductY',)]

## LAB 9: 1968년 1월 1일 이후 1월달에 태어났고 TX에 주소가 있는 직원은?

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.

[('Zelaya',)]

## Try this

In [39]:
%sql select 'cadfasdfaad' like '%a_';

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[(1,)]

In [40]:
%%sql

select 1+2+3 from dual; -- Oracle style

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[(6,)]

### Look at functions and operators part

https://dev.mysql.com/doc/refman/8.0/en/

In [ ]:
%sql select sha2('pasalallal', 256);

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.

[('c5911ef8716477d4c390df1e419c4082dc3401741b9a1d33620887cc3b6ea9d5',)]

In [ ]:
%sql select sha('password');

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.

[('5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8',)]

In [ ]:
%sql select truncate(1/3, 2)

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.

[(Decimal('0.33'),)]

In [ ]:
%sql select now();

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.

[(datetime.datetime(2020, 10, 27, 14, 34, 15),)]

In [ ]:
%sql select 'abc Houston,     TX, abc' regexp 'Houston *, *TX'

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.

[(1,)]

In [ ]:
%sql select 'aaaaaabdef' regexp '^(a|b|c)*def$'

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.

[(1,)]

In [ ]:
%%sql 

select dname, group_concat(lname) as names_in_dept
from DEPARTMENT d, EMPLOYEE e
where d.dnumber = e.dno
group by dnumber

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
3 rows affected.

[('Headquarters', 'Borg'),
 ('Administration', 'Wallace,Jabbar,Zelaya'),
 ('Research', 'Smith,Wong,English,Narayan')]

In [ ]:
%%sql 

select lname,fname
from EMPLOYEE order by fname limit 3

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
3 rows affected.

[('Jabbar', 'Ahmad'), ('Zelaya', 'Alicia'), ('Wong', 'Franklin')]

### user-defined variable을 사용하여 삽입 (Embedded SQL도 비슷하게 작동함)

In [ ]:
%%sql

select ssn into @ssn from EMPLOYEE where lname = 'Borg' and fname = 'James';
select pnumber into @pno from PROJECT where pname = 'Computerization';
select @ssn, @pno;

insert into WORKS_ON values (@ssn, @pno, 10);

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%sql select * from PROJECT

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
6 rows affected.

[('ProductX', 1, 'Bellaire', 5),
 ('ProductY', 2, 'Sugarland', 5),
 ('ProductZ', 3, 'Houston', 5),
 ('Computerization', 10, 'Stafford', 4),
 ('Reorganization', 20, 'Houston', 1),
 ('Newbenefits', 30, 'Stafford', 4)]

## Try this: transaction, commit/rollback in mysql client

#### Try this with mysql shell: sqlmagic is always autocommit
#### James Borg를 ProductX 프로젝트에 10시간 참여시킬 것.
```
\sql
\connect admin@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com
```
```
set autocommit=False;
select * from DEPENDENT;
delete from DEPENDENT;
rollback;
select * from DEPENDENT;
```
#### Deletion on DEPENDENT is ROLLBACKED
```
select * from DEPENDENT;
delete from DEPENDENT;
commit;
select * from DEPENDENT;
```
#### Deletion on DEPENDENT is COMMITTED; No way to revive them


## To try with transaction concurrecy control and isolation level, use two mysql shells

## LAB 10: ProductX에 참여하는 직원의 연봉을 10% 인상하시오.

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
2 rows affected.

[]

## LAB 11: James Borg의 부하직원의 연봉을 10% 인상하시오.

In [ ]:
%%sql
/* update 문장의 테이블을 where 절에 사용하면 semantics가 무한 순환 관계가 될 수 있음. 두 개의 SQL을 사용해야 함) */

update EMPLOYEE
set salary = 1.1 * salary
where ssn in (select e.ssn from EMPLOYEE e, EMPLOYEE s where s.fname = 'James' and s.lname = 'Borg' and e.superssn = s.ssn);

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/

InternalError: (pymysql.err.InternalError) (1093, "You can't specify target table 'EMPLOYEE' for update in FROM clause")
[SQL: /* update 문장의 테이블을 where 절에 사용하면 semantics가 무한 순환 관계가 될 수 있음. 두 개의 SQL을 사용해야 함) */

update EMPLOYEE
set salary = 1.1 * salary
where ssn in (select e.ssn from EMPLOYEE e, EMPLOYEE s where s.fname = 'James' and s.lname = 'Borg' and e.superssn = s.ssn);]
(Background on this error at: http://sqlalche.me/e/13/2j85)

## Nested Query

## LAB 12: James의 부하 직원의 이름은? 중첩질의 사용

In [16]:
%%sql

SELECT * FROM EMPLOYEE
WHERE Superssn = (SELECT Ssn FROM EMPLOYEE WHERE Fname = "James")

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4)]

## LAB 13: Houston에 사무실이 있는 부서명? 중첩질의 사용

In [40]:
%%sql

SELECT dname FROM DEPARTMENT
WHERE Dnumber in 
(SELECT Dnumber FROM DEPT_LOCATIONS WHERE Dlocation = "Houston")

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Headquarters',), ('Research',)]

## LAB 14: Houston과 Sugarland 모두에 사무실이 있는 부서명? 중첩질의 사용

In [41]:
%%sql

SELECT dname FROM DEPARTMENT
WHERE Dnumber in 
(SELECT Dnumber FROM DEPT_LOCATIONS WHERE Dlocation = "Houston")
and Dnumber in
(SELECT Dnumber FROM DEPT_LOCATIONS WHERE Dlocation = "Sugarland")

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Research',)]

## LAB 15: 최고 급여를 받는 직원의 이름은?

In [43]:
%%sql

SELECT lname, fname
from EMPLOYEE
where salary = (select max(salary) from EMPLOYEE)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Borg', 'James')]

In [44]:
%%sql

SELECT lname, fname
from EMPLOYEE
where salary >= all(select salary from EMPLOYEE)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Borg', 'James')]

In [60]:
%%sql

select lname, fname
from EMPLOYEE e
where not exists (select * from EMPLOYEE where e.salary < salary)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Borg', 'James')]

## LAB 16: 최고 급여가 아닌 사람은?

In [45]:
%%sql

SELECT lname, fname
from EMPLOYEE
where not salary >= all(select salary from EMPLOYEE)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
7 rows affected.

[('Smith', 'John'),
 ('Wong', 'Franklin'),
 ('English', 'Joyce'),
 ('Narayan', 'Ramesh'),
 ('Wallace', 'Jennifer'),
 ('Jabbar', 'Ahmad'),
 ('Zelaya', 'Alicia')]

In [46]:
%%sql

SELECT lname, fname
from EMPLOYEE
where salary != (select max(salary) from EMPLOYEE)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
7 rows affected.

[('Smith', 'John'),
 ('Wong', 'Franklin'),
 ('English', 'Joyce'),
 ('Narayan', 'Ramesh'),
 ('Wallace', 'Jennifer'),
 ('Jabbar', 'Ahmad'),
 ('Zelaya', 'Alicia')]

In [50]:
%%sql

SELECT lname, fname
from EMPLOYEE
where salary < any (select salary from EMPLOYEE)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
7 rows affected.

[('Smith', 'John'),
 ('Wong', 'Franklin'),
 ('English', 'Joyce'),
 ('Narayan', 'Ramesh'),
 ('Wallace', 'Jennifer'),
 ('Jabbar', 'Ahmad'),
 ('Zelaya', 'Alicia')]

In [62]:
%%sql

SELECT lname, fname
from EMPLOYEE e
where exists(select salary from EMPLOYEE where e.salary < salary)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
7 rows affected.

[('English', 'Joyce'),
 ('Jabbar', 'Ahmad'),
 ('Zelaya', 'Alicia'),
 ('Smith', 'John'),
 ('Narayan', 'Ramesh'),
 ('Wong', 'Franklin'),
 ('Wallace', 'Jennifer')]

## LAB 17: 상관 중첩 질의: 자신의 부서에서 최고 급여를 받는 직원의 이름과 부서명은?

In [59]:
%%sql

select d.dname, e.lname, e.fname
from EMPLOYEE e, DEPARTMENT d
where salary >= all (select f.salary from EMPLOYEE f where e.dno = f.dno)
and e.dno = d.dnumber

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('Administration', 'Wallace', 'Jennifer'),
 ('Headquarters', 'Borg', 'James'),
 ('Research', 'Wong', 'Franklin')]

## LAB 18: James Borg의 부하직원의 이름은? (EXISTS 사용)

In [63]:
%%sql

SELECT *
FROM EMPLOYEE e
WHERE EXISTS (
    select *
    from EMPLOYEE
    where e.Superssn = Ssn and Lname = "Borg"
)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4)]

## LAB 19: Houston과 Sugarland 모두에 office가 있는 부서명은? (EXISTS 사용)

In [78]:
%%sql

SELECT *
FROM DEPARTMENT D
WHERE EXISTS (
    SELECT * FROM DEPT_LOCATIONS D2 WHERE D.dnumber = D2.Dnumber and Dlocation = "Houston"
    AND EXISTS (
    SELECT * FROM DEPT_LOCATIONS D2 WHERE D.dnumber = D2.Dnumber and Dlocation = "Sugarland"
    )
)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Research', 5, '333445555', datetime.date(1988, 5, 22))]

In [67]:
%sql select * from DEPARTMENT;
%sql select * from DEPT_LOCATIONS;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
3 rows affected.
 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
5 rows affected.

[(1, 'Houston'),
 (4, 'Stafford'),
 (5, 'Bellaire'),
 (5, 'Houston'),
 (5, 'Sugarland')]

## LAB 20: ProductX에 참여하지 않는 직원의 이름은?

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
6 rows affected.

[('Franklin', 'Wong'),
 ('Ramesh', 'Narayan'),
 ('James', 'Borg'),
 ('Jennifer', 'Wallace'),
 ('Ahmad', 'Jabbar'),
 ('Alicia', 'Zelaya')]

In [109]:
%%sql

select *
from EMPLOYEE e
where not exists
(select *
from PROJECT p, WORKS_ON w
 where e.ssn = w.essn and p.pnumber = w.pno and p.pname = "ProductX")

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [111]:
%%sql
-- 틀린 예시************************************************************************************************
select *
from EMPLOYEE
where not exists
(select *
from EMPLOYEE e, PROJECT p, WORKS_ON w
 where e.ssn = w.essn and p.pnumber = w.pno and p.pname = "ProductX")

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

## LAB 21: 4번 부서가 담당하는 모든 프로젝트에 참여하는 사원들의 이름은?

In [135]:
%%sql

select * from EMPLOYEE e
where not exists 
(
    select * from WORKS_ON w
    where w.essn = e.ssn
    and not exists
    (
        select * from PROJECT p
        where w.pno = p.pnumber and p.dnum = 4
    )
)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

## LAB 22: Administration 부서의 모든 직원이 참여하는 프로젝트 이름은?

In [127]:
%%sql

SELECT *
from PROJECT p
where
not exists (
    select *
    from EMPLOYEE e, DEPARTMENT d
    where e.dno = d.dnumber and d.dname = "Administration" /*Administration 선택*/
    and
    NOT EXISTS (
        select *
        from WORKS_ON w
        where p.pnumber = w.pno and e.ssn = w.essn
    )
)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Newbenefits', 30, 'Stafford', 4)]

## LAB 23 직원과 직원의 상사가 있다면 그 상사의 이름들을 나열하시오.

In [ ]:
%%sql

select distinct e2.fname, e2.lname
from EMPLOYEE e1, EMPLOYEE e2
where e1.superssn = e2.ssn

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'Smith', 'Franklin', 'Wong'),
 ('Franklin', 'Wong', 'James', 'Borg'),
 ('Joyce', 'English', 'Franklin', 'Wong'),
 ('Ramesh', 'Narayan', 'Franklin', 'Wong'),
 ('James', 'Borg', None, None),
 ('Jennifer', 'Wallace', 'James', 'Borg'),
 ('Ahmad', 'Jabbar', 'Jennifer', 'Wallace'),
 ('Alicia', 'Zelaya', 'Jennifer', 'Wallace')]

## TRY JOIN, LEFT OUTER JOIN, RIGHT OUTER JOIN, CROSS JOIN FOR YOURSELF

In [140]:
%%sql

select * from (DEPARTMENT natural join DEPT_LOCATIONS);

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
5 rows affected.

[(1, 'Headquarters', '888665555', datetime.date(1981, 6, 19), 'Houston'),
 (4, 'Administration', '987654321', datetime.date(1995, 1, 1), 'Stafford'),
 (5, 'Research', '333445555', datetime.date(1988, 5, 22), 'Bellaire'),
 (5, 'Research', '333445555', datetime.date(1988, 5, 22), 'Houston'),
 (5, 'Research', '333445555', datetime.date(1988, 5, 22), 'Sugarland')]

In [144]:
%%sql

select fname, lname, address
from EMPLOYEE join DEPARTMENT ON dnumber = dno

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'Smith', '731-Fondren-Houston-TX'),
 ('Franklin', 'Wong', '638-Voss-Houston-TX'),
 ('Joyce', 'English', '5631-Rice-Houston-TX'),
 ('Ramesh', 'Narayan', '975-Fire-Oak-Humble-TX'),
 ('James', 'Borg', '450-Stone-Houston-TX'),
 ('Jennifer', 'Wallace', '291-Berry-Bellaire-TX'),
 ('Ahmad', 'Jabbar', '980-Dallas-Houston-TX'),
 ('Alicia', 'Zelaya', '3321-Castle-Spring-TX')]

In [145]:
%%sql

select fname, lname, address
from EMPLOYEE, DEPARTMENT
where dnumber = dno

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'Smith', '731-Fondren-Houston-TX'),
 ('Franklin', 'Wong', '638-Voss-Houston-TX'),
 ('Joyce', 'English', '5631-Rice-Houston-TX'),
 ('Ramesh', 'Narayan', '975-Fire-Oak-Humble-TX'),
 ('James', 'Borg', '450-Stone-Houston-TX'),
 ('Jennifer', 'Wallace', '291-Berry-Bellaire-TX'),
 ('Ahmad', 'Jabbar', '980-Dallas-Houston-TX'),
 ('Alicia', 'Zelaya', '3321-Castle-Spring-TX')]

In [146]:
%%sql

SELECT E.FNAME, E.LNAME, S.FNAME, S.LNAME
FROM EMPLOYEE AS E LEFT OUTER JOIN EMPLOYEE AS S ON E.SUPERSSN = S.SSN

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'Smith', 'Franklin', 'Wong'),
 ('Franklin', 'Wong', 'James', 'Borg'),
 ('Joyce', 'English', 'Franklin', 'Wong'),
 ('Ramesh', 'Narayan', 'Franklin', 'Wong'),
 ('James', 'Borg', None, None),
 ('Jennifer', 'Wallace', 'James', 'Borg'),
 ('Ahmad', 'Jabbar', 'Jennifer', 'Wallace'),
 ('Alicia', 'Zelaya', 'Jennifer', 'Wallace')]

In [147]:
%%sql

SELECT E.FNAME, E.LNAME, S.FNAME, S.LNAME
FROM EMPLOYEE AS E JOIN EMPLOYEE AS S ON E.SUPERSSN = S.SSN

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
7 rows affected.

[('John', 'Smith', 'Franklin', 'Wong'),
 ('Franklin', 'Wong', 'James', 'Borg'),
 ('Joyce', 'English', 'Franklin', 'Wong'),
 ('Ramesh', 'Narayan', 'Franklin', 'Wong'),
 ('Jennifer', 'Wallace', 'James', 'Borg'),
 ('Ahmad', 'Jabbar', 'Jennifer', 'Wallace'),
 ('Alicia', 'Zelaya', 'Jennifer', 'Wallace')]

### Oracle, MySQL에서 from 절에 select 사용하기.

In [141]:
%%sql

select e.fname, e.lname
from (select * from EMPLOYEE where dno = 5) e
where e.salary >= 30000;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('John', 'Smith'), ('Franklin', 'Wong'), ('Ramesh', 'Narayan')]

### 위를 흉내내서 Research 부서의 부서장의 이름은? outer select 문에 where 절 없이 작성

In [ ]:
%%sql

select e.fname, e.lname
from (select * from DEPARTMENT where dname = 'Research') m 
     join 
     EMPLOYEE e 
     on e.ssn = m.mgrssn;

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.

[('Franklin', 'Wong')]

In [158]:
%sql DROP TEMPORARY TABLE tempssn

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

In [155]:
%%sql

CREATE TEMPORARY TABLE tempssn
SELECT E1.Ssn as ssn1, E2.Ssn as ssn2, E2.Superssn as superssn
FROM EMPLOYEE E1, EMPLOYEE E2
WHERE E1.Ssn = 888665555

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[]

In [156]:
%sql select * from tempssn

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('888665555', '888665555', None),
 ('888665555', '123456789', '333445555'),
 ('888665555', '453453453', '333445555'),
 ('888665555', '666884444', '333445555'),
 ('888665555', '333445555', '888665555'),
 ('888665555', '987654321', '888665555'),
 ('888665555', '987987987', '987654321'),
 ('888665555', '999887777', '987654321')]

## LAB 24: 최대급여를 받는 직원의 이름은? (Use aggregate function)

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.

[('James', 'Borg')]

## LAB 25: 부서별 최대급여를 받는 직원의 이름은? (Use aggregate function)

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
3 rows affected.

[('Franklin', 'Wong'), ('James', 'Borg'), ('Jennifer', 'Wallace')]

## LAB 26: 2개의 PROJECT에 참여하는 직원의 이름은?

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
6 rows affected.

[('John', 'Smith'),
 ('Joyce', 'English'),
 ('James', 'Borg'),
 ('Jennifer', 'Wallace'),
 ('Ahmad', 'Jabbar'),
 ('Alicia', 'Zelaya')]

## LAB 27: 모든 PROJECT에 참여하는 직원의 이름은? (Using count; Never recommended)

Note: PK/FK 제약 조건에 의존하여 성립되는 질의임

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
0 rows affected.

[]

## LAB 28: 직원별 참여 프로젝트 수는?

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
8 rows affected.

[('123456789', 2),
 ('333445555', 4),
 ('453453453', 2),
 ('666884444', 1),
 ('888665555', 2),
 ('987654321', 2),
 ('987987987', 2),
 ('999887777', 2)]

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
8 rows affected.

[('Smith', 'John', 2),
 ('Wong', 'Franklin', 4),
 ('English', 'Joyce', 2),
 ('Narayan', 'Ramesh', 1),
 ('Borg', 'James', 2),
 ('Wallace', 'Jennifer', 2),
 ('Jabbar', 'Ahmad', 2),
 ('Zelaya', 'Alicia', 2)]

## LAB 29: 부양가족수가 2 이상 직원의 이름은?

In [ ]:
%%sql

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
7 rows affected.

[('Smith', 'John'),
 ('Wong', 'Franklin'),
 ('English', 'Joyce'),
 ('Borg', 'James'),
 ('Wallace', 'Jennifer'),
 ('Jabbar', 'Ahmad'),
 ('Zelaya', 'Alicia')]

## Creating Trigger: MySQL syntax

```
CREATE
    [DEFINER = { user | CURRENT_USER }]
    TRIGGER trigger_name
    trigger_time trigger_event
    ON tbl_name FOR EACH ROW
    trigger_body

trigger_time: { BEFORE | AFTER }

trigger_event: { INSERT | UPDATE | DELETE }
```

### How to enable Trigger and stored procedure on AWS RDS

1. Create a new instance of MySQL RDS (if you have a current instance this will work too.)
2. Click on Create Parameter (You will see your default parameter group. You can not edit this group, you must make a new parameter group to edit.)
3. Fill in the required information then click create.
4. Once you see your parameter group in the parameter group table check the box next to it.
5. Click on the parameter group actions dropdown menu.
6. Click edit.
7. Search in the filter input for log_bin_trust_function_creators 
8. Change the setting from 0 to 1
9. Then click Save Changes
10. Now we need to assign the parameter group to the MySQL DB instance.
11. Find your instances
12. Check the radio button next to the instance you wish to assign the parameter group to
14. click Modify
15. Find the DB parameter group drop down
16. Select the newly created triggers parameter group.
16. Choose 'Immediately' in scheduling of modifications
17. Click continue
18. Then save the DB changes
19. Once you make the update you will need to reboot the DB instance before the triggers can be added.
20. Go ahead and reboot your DB instance.
21. Now you can create triggers in your MySQL instance.

![image.png](attachment:image.png)

![image.png](attachment:image.png)

![image.png](attachment:image.png)

In [ ]:
%sql drop table if exists salary_audit;

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/

C:\Users\ksohn\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1051, "Unknown table 'companydb.salary_audit'")
  result = self._query(query)

0 rows affected.

[]

In [ ]:
%%sql

create table salary_audit (
  essn char(9),
  before_salary decimal(10,2),
  after_salary decimal(10,2),
  udatetime datetime
);

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%sql drop trigger if exists salary_audit_trig

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/

C:\Users\ksohn\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1360, 'Trigger does not exist')
  result = self._query(query)

0 rows affected.

[]

In [ ]:
%%sql

create trigger salary_audit_trig
after update
on EMPLOYEE
for each row
begin
if new.salary <> old.salary then
	insert into salary_audit values (new.ssn, old.salary, new.salary, now());
end if;
end

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%%sql

update EMPLOYEE set salary = salary * 1.1 where dno = 5

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
4 rows affected.

[]

In [ ]:
%sql select * from salary_audit;

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
4 rows affected.

[('123456789', Decimal('33000.00'), Decimal('36300.00'), datetime.datetime(2020, 10, 27, 14, 37, 3)),
 ('333445555', Decimal('40000.00'), Decimal('44000.00'), datetime.datetime(2020, 10, 27, 14, 37, 3)),
 ('453453453', Decimal('27500.00'), Decimal('30250.00'), datetime.datetime(2020, 10, 27, 14, 37, 3)),
 ('666884444', Decimal('38000.00'), Decimal('41800.00'), datetime.datetime(2020, 10, 27, 14, 37, 3))]

In [ ]:
%sql select * from EMPLOYEE

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('36300.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('44000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('30250.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('41800.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

### Test if stored procedure works

In [ ]:
%sql drop procedure if exists p1;

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/

C:\Users\ksohn\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1305, 'PROCEDURE companydb.p1 does not exist')
  result = self._query(query)

0 rows affected.

[]

In [ ]:
%%sql

create procedure p1()
    select 'Hello World';

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
0 rows affected.

[]

In [ ]:
%sql call p1()

 * mysql+pymysql://admin:***@ksohndb.c8hr4dzksmx8.us-east-2.rds.amazonaws.com:3306/
1 rows affected.

[('Hello World',)]